Craix/OKDO_E1_RTC_Test/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define ENCODER_A_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define ENCODER_A_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define ENCODER_A_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define ENCODER_A_PIN 8U                   /*!<@brief PORT pin number */
#define ENCODER_A_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PIO1_9 (number 10), ENC
  @{ */

/* Symbols to be used with GPIO driver */
#define ENCODER_B_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define ENCODER_B_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define ENCODER_B_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define ENCODER_B_PIN 9U                   /*!<@brief PORT pin number */
#define ENCODER_B_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PIO1_10 (number 40), ENC
  @{ */

/* Symbols to be used with GPIO driver */
#define ENCODER_S_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define ENCODER_S_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define ENCODER_S_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define ENCODER_S_PIN 10U                   /*!<@brief PORT pin number */
#define ENCODER_S_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PIO1_8 (number 24), ENC
  @{ */
#define ENCODER_INTA_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define ENCODER_INTA_PIN 8U                   /*!<@brief PORT pin number */
#define ENCODER_INTA_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Encoder(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
